import React from 'react';
import { BrowserRouter as Router } from "react-router-dom";
import "./App.css";  // 전역 스타일로 불러오기
import Footer from "./components/Footer";

const App = () => {
    return (

        <div className="app-container">
            <div className="main-content">
                <h1>안녕하세요</h1>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p><p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이
                가능합니다.</p><p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p><p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이
                가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p><p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이
                가능합니다.</p><p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
                <p>여기에 스크롤 가능한 콘텐츠가 들어갑니다. 이 부분이 길어질 경우, 스크롤이 가능합니다.</p>
            </div>
            <Footer/>
        </div>
    );
}

export default App;
